lab11/nrf5x-base/lib/simple_ble/simple_ble.c
    ble_advertising_on_sys_evt(sys_evt, &m_advertising);
}

// Can also simply use "cp_init.disconnect_on_fail = true;
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt) {
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(app.conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

#ifdef ENABLE_DFU
static void interrupts_disable(void) {
    uint32_t interrupt_setting_mask;
    uint32_t irq = 0; // We start from first interrupt, i.e. interrupt 0.

    // Fetch the current interrupt settings.
    interrupt_setting_mask = NVIC->ISER[0];

    for (; irq < MAX_NUMBER_INTERRUPTS; irq++)
    {
        if (interrupt_setting_mask & (IRQ_ENABLED << irq))
        {
            // The interrupt was enabled, and hence disable it.
            NVIC_DisableIRQ((IRQn_Type)irq);
        }
    }
}
#endif

static void on_ble_evt(ble_evt_t * p_ble_evt) {
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED: {

            app.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

            // Continue advertising, but nonconnectably
            m_adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;

            advertising_start();

            // Connected to device. Set initial CCCD attributes to NULL
            err_code = sd_ble_gatts_sys_attr_set(app.conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);

            // Callback for user. Weak reference, so check validity first
            if (ble_evt_connected) {
                ble_evt_connected(p_ble_evt);
            }
            break;
        }
        case BLE_GAP_EVT_DISCONNECTED: {

            // Invalidate handle
            app.conn_handle = BLE_CONN_HANDLE_INVALID;

            advertising_stop();

#ifdef ENABLE_DFU
            // If pending dfu, clear and disable irq and then reset to bootloader
                if (pending_dfu) {
                    pending_dfu = 0;
                    dfu_reset();
                }
#endif
            // Go back to advertising connectably
            m_adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
            advertising_start();

            // Callback for user. Weak reference, so check validity first
            if (ble_evt_disconnected) {
                ble_evt_disconnected(p_ble_evt);
            }
            break;
        }
        case BLE_GATTS_EVT_WRITE: {
#ifdef ENABLE_DFU
            // if written to dfu ctrl pt
            if (simple_ble_is_char_event(p_ble_evt, &dfu_ctrlpt_char)) {
                pending_dfu = 1;
                // disconnect, wait for event.
                err_code = sd_ble_gap_disconnect(app.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;
            }
#endif
            // Callback for user. Weak reference, so check validity first
            if (ble_evt_write) {
                ble_evt_write(p_ble_evt);
            }
            break;
        }
        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST: {
            // Callback for user. Weak reference, so check validity first
            if (ble_evt_rw_auth) {
                ble_evt_rw_auth(p_ble_evt);
            }
            break;
        }
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST: {
            // Pairing
            err_code = sd_ble_gap_sec_params_reply(app.conn_handle,
                                                   BLE_GAP_SEC_STATUS_SUCCESS, &m_sec_params, NULL);
            APP_ERROR_CHECK(err_code);
            break;
        }
        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            // No system attributes have been stored
            err_code = sd_ble_gatts_sys_attr_set(app.conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;
        }
        case BLE_GAP_EVT_AUTH_STATUS: {

            break;
        }
        case BLE_GAP_EVT_SEC_INFO_REQUEST: {
            // No keys found for this device.
            err_code = sd_ble_gap_sec_info_reply(app.conn_handle, NULL, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
        }
        case BLE_GAP_EVT_TIMEOUT: {

            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                err_code = sd_power_system_off();
                APP_ERROR_CHECK(err_code);
            }
            break;
        }
        case BLE_GATTC_EVT_TIMEOUT: {
            // Disconnect on GATT Client timeout event
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;
        }
        case BLE_GATTS_EVT_TIMEOUT: {
            // Disconnect on GATT Server timeout event
            if (p_ble_evt->evt.gatts_evt.params.timeout.src == BLE_GATT_TIMEOUT_SRC_PROTOCOL) {
                err_code = sd_ble_gap_disconnect(app.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
            }
            break;
        }
        case BLE_GAP_EVT_ADV_REPORT: {
#ifdef ENABLE_DFU
            #ifdef SOFTDEVICE_s130
              // check if DFU advertisement
              uint8_t data[31];
              int len = parse_adata(p_ble_evt, 0xFF, data);

              if (len > 4 && len <= 31 &&
                  *((short *) data) == 0x02E0 &&
                  data[2] == DFU_ADV_DATA_TYPE &&
                  data[3] == DFU_ADV_DATA_VERS)
              {
                ble_gap_addr_t gap_addr;
                sd_ble_gap_address_get(&gap_addr);

                if (memcmp(data+4, gap_addr.addr, 6) == 0) {
                  dfu_reset();
                }
              }
#endif
#endif

            if (ble_evt_adv_report) {
                ble_evt_adv_report(p_ble_evt);
            }
            break;
        }
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
            ble_gap_phys_t const phys =
                    {
                            .rx_phys = BLE_GAP_PHY_AUTO,
                            .tx_phys = BLE_GAP_PHY_AUTO,
                    };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
            break;
        }
        default:
            break;
    }

    // Allow users to handle events themselves if they want weak reference, check validity before calling
    if (ble_evt_user_handler) {
        ble_evt_user_handler(p_ble_evt);
    }
}



